Tekla.Structures.Plugins.AutoDirectionTypeAttribute
The AutoDirectionTypeAttribute class is used for storing the auto direction type.
Based on the type the system will then calculate the up direction of the connection/detail
if the "Auto" up direction is chosen in the dialog.
The attribute is initialized from the custom attribute
[AutoDirectionType(AutoDirectionTypeEnum.AUTODIR_DETAIL)]
in the connection/detail source.

Tekla.Structures.Plugins.AutoDirectionTypeAttribute.#ctor(Tekla.Structures.AutoDirectionTypeEnum)
The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system.
This is not to be used by itself.
Type: The auto direction type.

Tekla.Structures.Plugins.AutoDirectionTypeAttribute.Type
The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.AutoDirectionTypeAttribute.#ctor(System.Int32)
The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system.
This is not to be used by itself.
Type: The auto direction type.